{
	"FormatVersion": 2,
	"Namespace": "",
	"Children": [
		{
			"Source":
			{
				"Text": "\"相机在相片中\",  原游戏中第一次遇见相机的时候也是这样"
			},
			"Translation":
			{
				"Text": "\"There is a camera in photo.\" It's just like when you first get the camera in the original game."
			},
			"Key": "E3B5C65149692EB656DF4ABCA2B73E20"
		},
		{
			"Source":
			{
				"Text": "1. 重叠检测. 筛选组件, 拍照前准备(替身处理在此)."
			},
			"Translation":
			{
				"Text": "1. Overlap Detection. Process Overlapped Components."
			},
			"Key": "163C8FDB4F1E148E7813ADBA68D5165B"
		},
		{
			"Source":
			{
				"Text": "1. 重叠检测. 筛选组件."
			},
			"Translation":
			{
				"Text": "1. Overlap Detection. Process Overlapped Components."
			},
			"Key": "05453AE541E50D10BC41D29A914C790F"
		},
		{
			"Source":
			{
				"Text": "2. 使用动态网格替换筛选后的组件."
			},
			"Translation":
			{
				"Text": "Use UVFDynamicMeshComponents to replace UPrimitiveComponents processed."
			},
			"Key": "DDD720924EF8B6AC59E126A1C3C0FED2"
		},
		{
			"Source":
			{
				"Text": "2. 使用动态网格替换筛选后的组件. 网格切割."
			},
			"Translation":
			{
				"Text": "2. Replace processed UPrimitiveComponents with UVFDynamicMeshComponents. Perform mesh cutting."
			},
			"Key": "15048E9A4FC4EBC41E4CAD93CC1DB62D"
		},
		{
			"Source":
			{
				"Text": "3. Photo3D启用所有的动态网格."
			},
			"Translation":
			{
				"Text": "3. Enable all UVFDynamicMeshComponents within Photo3D."
			},
			"Key": "05EDAA624AC82834FC4E55BEA44AE910"
		},
		{
			"Source":
			{
				"Text": "3. 复制Actor(拆离动态网格复制后再装载)."
			},
			"Translation":
			{
				"Text": "3. Duplicate Actors(Detach UVFDynamicMeshComponents, duplicate, then reattach)"
			},
			"Key": "210823A3428855E70642C6A3B0EED5A0"
		},
		{
			"Source":
			{
				"Text": "4. 原Actor网格与视锥做差集(如果剪切). 副本Actor网格与视锥取交集."
			},
			"Translation":
			{
				"Text": "4. The original Actor's mesh is subtracted from the view frustum (if cutting is enabled). The copied Actor's mesh is intersected with the view frustum."
			},
			"Key": "E908E729452709DDA5E95B9537445219"
		},
		{
			"Source":
			{
				"Text": "5. 拍照: 设置Stencil, 只对复制出来的Actor进行拍照. 背景绘制."
			},
			"Translation":
			{
				"Text": "5. Capture: Set stencil values to capture only the duplicated(By default) Actors. Render the background."
			},
			"Key": "095C4D29469FFB0A1E95929BEC6578CD"
		},
		{
			"Source":
			{
				"Text": "6. Photo2D和Photo3D的后续处理."
			},
			"Translation":
			{
				"Text": "6. Subsequent processing for Photo2D and Photo3D."
			},
			"Key": "786120784F0098C3A15D46918F7E5041"
		},
		{
			"Source":
			{
				"Text": "AVFTransfromRecorderActor下的基元组件会进行重叠检测."
			},
			"Translation":
			{
				"Text": "The UPrimitiveComponent under AVFTransfromRecorderActor performs overlap detection"
			},
			"Key": "8D231139433A00BDCECBB4ADF9A99FD0"
		},
		{
			"Source":
			{
				"Text": "Alt+Enter: 切换全屏/窗口化"
			},
			"Translation":
			{
				"Text": "Alt+Enter: Toggle full-screen/windowed"
			},
			"Key": "5C80C5FF4E934F183F7533BA569B8ECB"
		},
		{
			"Source":
			{
				"Text": "Demo介绍:"
			},
			"Translation":
			{
				"Text": "Demo Introduction"
			},
			"Key": "FE207E844290055DBA6B82A7059BE712"
		},
		{
			"Source":
			{
				"Text": "E"
			},
			"Translation":
			{
				"Text": "E"
			},
			"Key": "C6C5DD8E43E5E1947D1735ACB7A81F27"
		},
		{
			"Source":
			{
				"Text": "EVFStencilRule枚举类决定被拍入网格的stencil以何种方式变动."
			},
			"Translation":
			{
				"Text": "enum class EVFStencilRule defines how stencil value of UPrimitiveComponent is modified."
			},
			"Key": "EB297A524300674328074A9B5CD0117B"
		},
		{
			"Source":
			{
				"Text": "Esc: 退出游戏"
			},
			"Translation":
			{
				"Text": "Esc: Quiting game"
			},
			"Key": "ABD093F945FCCE850B31559EE9D84F76"
		},
		{
			"Source":
			{
				"Text": "GitHub: https://github.com/StrangeDS"
			},
			"Translation":
			{
				"Text": "GitHub: https://github.com/StrangeDS"
			},
			"Key": "8E58726E46C2CA59EBC76BA8391E4F86"
		},
		{
			"Source":
			{
				"Text": "IVFStandInInterface: 返回用于替换的网格体, 返回原Actor的引用"
			},
			"Translation":
			{
				"Text": "IVFStandInInterface: returns the replacement UPrimitiveComponent, and returns a reference to the original Actor."
			},
			"Key": "3B8C55F54A186533E26BCABFDB89AA00"
		},
		{
			"Source":
			{
				"Text": "L_A7_Base是最开始的设计场景,"
			},
			"Translation":
			{
				"Text": "L_A7_Base serves as the initial design scene."
			},
			"Key": "8E630D44405BD2F583B9799AD41B225B"
		},
		{
			"Source":
			{
				"Text": "OuterWilds的\"未渲染世界\"中, 不同的物体有不同的效果也能实现"
			},
			"Translation":
			{
				"Text": "In the \"unrendered world\" of Outer Wilds, different objects can also exhibit distinct effects."
			},
			"Key": "865478E74F6106B932917DB8F280DA8A"
		},
		{
			"Source":
			{
				"Text": "StencilBase也是搭配Rule使用的, 具体参看:"
			},
			"Translation":
			{
				"Text": "StencilBase is used in combination with Rule — see details at:"
			},
			"Key": "1F5FE4D64E0619381187DA950D1A97F0"
		},
		{
			"Source":
			{
				"Text": "UVFPostProcessComponent::SetStencilValueNext_Implementation()"
			},
			"Translation":
			{
				"Text": "UVFPostProcessComponent::SetStencilValueNext_Implementation()"
			},
			"Key": "C7A34FBB41CE8C6CD9F276A925452A3E"
		},
		{
			"Source":
			{
				"Text": "UVFStepsRecordInterface: 支持回溯."
			},
			"Translation":
			{
				"Text": "UVFStepsRecordInterface: Is designed to support time rewind."
			},
			"Key": "15FEFF5847F7CC0A744F68A07D9CAD96"
		},
		{
			"Source":
			{
				"Text": "UpdateMIC()更新照片纹理, 绕开了几乎所有的特殊处理"
			},
			"Translation":
			{
				"Text": "UpdateMIC() updates the Photo2D's texture, bypassing nearly all special handling."
			},
			"Key": "D0BF1497437122E89B327B8A76085E0A"
		},
		{
			"Source":
			{
				"Text": "VFGeometryDeveloperSettings: 设置几何策略实现类, 碰撞生成参数等"
			},
			"Translation":
			{
				"Text": "VFGeometryDeveloperSettings: Configures the \"GeometryStrategyClass\", collision generation parameters, and more."
			},
			"Key": "582B07CA40A7817135D0E2B7EC0A154E"
		},
		{
			"Source":
			{
				"Text": "VFHelperInterface: 返回Helper组件."
			},
			"Translation":
			{
				"Text": "VFHelperInterface: returns UHelperComponent."
			},
			"Key": "092D612140073D778866C5A0CFC78924"
		},
		{
			"Source":
			{
				"Text": "VFPhotoCatcherDeveloperSettings: 设置是否生成背景面Actor, 及相关参数"
			},
			"Translation":
			{
				"Text": "VFPhotoCatcherDeveloperSettings: Configures PlaneActor generation and related parameters."
			},
			"Key": "73F387E741CC01EEC7857D9B1A1B118F"
		},
		{
			"Source":
			{
				"Text": "VFPhotoCommonDeveloperSettings: 设置查找Helper组件的方式"
			},
			"Translation":
			{
				"Text": "VFPhotoCommonDeveloperSettings: Configures the method for getting UHelperComponent."
			},
			"Key": "6F3F20ED4017456B2F89018651CC0D91"
		},
		{
			"Source":
			{
				"Text": "VFStepsRecorderDeveloperSettings: 回溯系统相关设置"
			},
			"Translation":
			{
				"Text": "VFStepsRecorderDeveloperSettings: Time rewind settings"
			},
			"Key": "01EDBE504E7FAF78631309BF6DB62689"
		},
		{
			"Source":
			{
				"Text": "VFUObjsPoolWorldSubsystem提供了组件级别的对象池"
			},
			"Translation":
			{
				"Text": "Use VFUObjsPoolWorldSubsystem to provides a component-level object pool."
			},
			"Key": "4EB0DCDB43CC33F079FBC69ED3E3F057"
		},
		{
			"Source":
			{
				"Text": "_Show中布尔变量PlacePhoto3D将决定是否破坏当前地形,"
			},
			"Translation":
			{
				"Text": "In _Show BlueprintClass, the \"PlacePhoto3Diang\" determines whether to cut the current scene."
			},
			"Key": "11A09C854600B6EF39AB82B59D717973"
		},
		{
			"Source":
			{
				"Text": "一个全部显示体积, 将墙体全部显示."
			},
			"Translation":
			{
				"Text": "Display All Volume: When triggered, will show all walls."
			},
			"Key": "DD919D2845948C7C632B998D5CA39C61"
		},
		{
			"Source":
			{
				"Text": "一个重置体积, 会将全部墙体重置."
			},
			"Translation":
			{
				"Text": "Reset Volume: When triggered, will reset all walls to hide."
			},
			"Key": "F7D498F5427E41BE8A6B0686590789DB"
		},
		{
			"Source":
			{
				"Text": "上方方块: 在照片中显示, 但不进入拍照流程, 可以被照片切割."
			},
			"Translation":
			{
				"Text": "Top cube: Appears in the Photo2D's image, but it does not enter the photo-taking process; it can be cut by photo3D."
			},
			"Key": "8B497408442FAE50625B60B378DED07A"
		},
		{
			"Source":
			{
				"Text": "下一关很多相机, 建议放下所有的相机."
			},
			"Translation":
			{
				"Text": "Next level has many PhotoCatchers — recommend dropping them all down."
			},
			"Key": "22D463FE4BD3B3BE37359AA2E0370ED1"
		},
		{
			"Source":
			{
				"Text": "不勾选则场景中所有的东西都能进入拍照流程(通用性),"
			},
			"Translation":
			{
				"Text": "When unchecked, all objects in scene can enter the photo-taking process (universal applicability)."
			},
			"Key": "1BE30CE242CBE1AEABB1C9A1C07F8A60"
		},
		{
			"Source":
			{
				"Text": "不支持网络, 投影图案颜色不匹配, 未实现相对光影."
			},
			"Translation":
			{
				"Text": "Do not support for network. Projection Color Mismatch. Do not implemente Relative Shadows."
			},
			"Key": "0175DBDB4F5B86D00B3AC19EB6476637"
		},
		{
			"Source":
			{
				"Text": "不过效果还是蛮酷的."
			},
			"Translation":
			{
				"Text": "But the results are pretty cool!"
			},
			"Key": "A1FE746341CC90E7475144B85645B877"
		},
		{
			"Source":
			{
				"Text": "个人学习项目.无商业目的."
			},
			"Translation":
			{
				"Text": "A learning project with no commercial intent."
			},
			"Key": "7FE5D0594FF8C22220CA268BD8C825EC"
		},
		{
			"Source":
			{
				"Text": "为了让内容尽可能紧凑, 每个关卡功能都很少重复"
			},
			"Translation":
			{
				"Text": "To keep content highly streamlined, level mechanics are designed with minimal repetition."
			},
			"Key": "A6307F1C470D8C3B0E56CBB69DEAFAE3"
		},
		{
			"Source":
			{
				"Text": "为防止裁剪过多场景, 我将远平面设置得比较近."
			},
			"Translation":
			{
				"Text": "To avoid cutting too much of scene, I set the far plane relatively close."
			},
			"Key": "92344F614602AE04CA93D9B374B4BFFD"
		},
		{
			"Source":
			{
				"Text": "也通过回溯到拾起相机前, 来放下相机."
			},
			"Translation":
			{
				"Text": "Alternatively, you can rewind to before picking up PhotoCatcher in order to drop it down."
			},
			"Key": "2C8CE60B49274D8D9A5A77A0A3ECDB7B"
		},
		{
			"Source":
			{
				"Text": "人物瞬移有特殊处理, 参看AVFCharacter::TickForward_Implementation()."
			},
			"Translation":
			{
				"Text": "Teleportation — see AVFCharacter::TickForward_Implementation() for special handling."
			},
			"Key": "F1D4AF584EC3C02257B4D29AFAC53D75"
		},
		{
			"Source":
			{
				"Text": "从这里开始↘"
			},
			"Translation":
			{
				"Text": "Start from here↘"
			},
			"Key": "2F950BCD4E6DD83DBE048089D86295BE"
		},
		{
			"Source":
			{
				"Text": "从这里开始↘"
			},
			"Translation":
			{
				"Text": "Start from here↘"
			},
			"Key": "98C5FC004BD996137D556B83E72BDDB8"
		},
		{
			"Source":
			{
				"Text": "以及更多的参数设置: CheckInterval, RotationTolerance."
			},
			"Translation":
			{
				"Text": "along with additional parameter settings: CheckInterval, RotationTolerance."
			},
			"Key": "3F784E83472D97E90E78A79F86F1FFE6"
		},
		{
			"Source":
			{
				"Text": "以及添加和使用委托, 用来做更多的流程操作:OnReplace, OnRestore."
			},
			"Translation":
			{
				"Text": "Additionally, add and utilize delegates for extended workflow control: OnReplace, OnRestore."
			},
			"Key": "DC231F07460F9A6B723F1093DBDFC780"
		},
		{
			"Source":
			{
				"Text": "仿原游戏中西瓜滤镜的相机,"
			},
			"Translation":
			{
				"Text": "Reproduce watermelon filter in ViewFinder."
			},
			"Key": "B60A508B4CCF2CC6AB31D38156EFDC10"
		},
		{
			"Source":
			{
				"Text": "会经过两次光照流程, 导致其亮度偏暗/亮."
			},
			"Translation":
			{
				"Text": "These objects undergoes two lighting processes, causing it to appear darker or brighter than intended."
			},
			"Key": "05E959CD487490EDB7C94B870B4872D8"
		},
		{
			"Source":
			{
				"Text": "但你可以手动放置进去, 还不会有动态网格体组件出现."
			},
			"Translation":
			{
				"Text": "However, you can manually place it without triggering the creation of a UDynamicMeshComponent."
			},
			"Key": "1E63CC0D4E620AA704E8038E903BBCEB"
		},
		{
			"Source":
			{
				"Text": "但你完全可以手动设置VFBackgroundCaptureComponent的ShowOnlyActors列表"
			},
			"Translation":
			{
				"Text": "However, you can always manually configure the ShowOnlyActors list of the VFBackgroundCaptureComponent."
			},
			"Key": "6081590D4E9340C7B7C13B860918B468"
		},
		{
			"Source":
			{
				"Text": "但你需要按X键放下它, 并离相机远些才能看到."
			},
			"Translation":
			{
				"Text": "However, you need to press X to drop it and move further from the camera, and then you can see."
			},
			"Key": "2053A432464FCC4434EB098623C6ACA9"
		},
		{
			"Source":
			{
				"Text": "但它会被放置的照片切割. 支持回溯, 放心尝试."
			},
			"Translation":
			{
				"Text": "However, it can be cut by Photo3D's placing — but it supports rewinding, feel free to experiment."
			},
			"Key": "F06AD20C49912E48D06B899D02855ABB"
		},
		{
			"Source":
			{
				"Text": "但它携带了Helper组件, 还实现了接口, 意味着你可以把它\"取出来\"."
			},
			"Translation":
			{
				"Text": "But it carries UHelperComponent, and implements the interface, meaning you can \"take it out\"."
			},
			"Key": "BEFFB1AE4F2CE5E6763E9C9617C6B041"
		},
		{
			"Source":
			{
				"Text": "但对于不同的Actor, 肯定需要有不同的处理."
			},
			"Translation":
			{
				"Text": "However, different Actors will naturally require different handling."
			},
			"Key": "3EA4BFD04286117096CFED8D27D411D9"
		},
		{
			"Source":
			{
				"Text": "作者: StrangeDS"
			},
			"Translation":
			{
				"Text": "Developed by: StrangeDS"
			},
			"Key": "D9D608F745DA38C0B3A1D5ADAFAC9277"
		},
		{
			"Source":
			{
				"Text": "你会发现VFTransfromRecorderActor不在新场景中出现, 这是正常的."
			},
			"Translation":
			{
				"Text": "You'll notice that VFTransfromRecorderActor doesn't appear in new ULevel — this is intentional."
			},
			"Key": "910614EB467366CC1CF4F2ACDF67DC48"
		},
		{
			"Source":
			{
				"Text": "使用: Helper勾选ReplacedWithStandIn,并设置StandInClass,"
			},
			"Translation":
			{
				"Text": "Usage: In the UHelperComponent, set ReplacedWithStandIn to ture and set the StandInClass value."
			},
			"Key": "851183F5490182782266658EC34C4236"
		},
		{
			"Source":
			{
				"Text": "使用Helper组件可以配置Actor在拍照流程中的表现."
			},
			"Translation":
			{
				"Text": "The UHelperComponent allows you to configure how an Actor behaves in the photo-taking process."
			},
			"Key": "F7E485034FDFDD8067EFF6B5ED5C762F"
		},
		{
			"Source":
			{
				"Text": "使用固定相机对方块进行拍摄, 放置照片, 查看委托的触发"
			},
			"Translation":
			{
				"Text": "Use the fixed camera to take a photo of the block, place photo, and observe what delegates are triggered."
			},
			"Key": "7B0FE5AC4165B926F2A9BD9EA9C62A38"
		},
		{
			"Source":
			{
				"Text": "使用委托, 在拍照流程中, 相片副本先递归复制Photo3D内的Actors,"
			},
			"Translation":
			{
				"Text": "Using delegates, during the photo-taking process, the copied photo first recursively duplicates the Actors within Photo3D."
			},
			"Key": "DFA0882040ED0CA3C39F4DA409ED3950"
		},
		{
			"Source":
			{
				"Text": "使用成本较低, 学习成本较高."
			},
			"Translation":
			{
				"Text": "The cost of use is relatively low, but the learning cost is relatively high."
			},
			"Key": "97CB4581486B12669CBB7BB9C4C3FBB0"
		},
		{
			"Source":
			{
				"Text": "使用这个携带了\"失真\"滤镜的手持相机对前面的照片进行拍照."
			},
			"Translation":
			{
				"Text": "Use this PhotoCatcher with distortion filter to take a photo of the Photo2D."
			},
			"Key": "47D978D94A8D2ACD20D3728D26A685B0"
		},
		{
			"Source":
			{
				"Text": "例如BP_TransformRecorder, 为了不检测到视锥, 设置了其碰撞预设,"
			},
			"Translation":
			{
				"Text": "Take BP_TransformRecorder as an example. To avoid being detected by the ViewFrustum, its Collision Preset has been configured accordingly."
			},
			"Key": "0F871C5A46F587DD2646DDA4EBCA27D4"
		},
		{
			"Source":
			{
				"Text": "例如L_A4中就手动添加了自己的天空盒"
			},
			"Translation":
			{
				"Text": "For example, in L_A4, skybox has been manually added in it."
			},
			"Key": "F47BB7D34E3436932AB3BF9E9A666446"
		},
		{
			"Source":
			{
				"Text": "偏色: RGB颜色通道不断交换."
			},
			"Translation":
			{
				"Text": "Color Shift: Continuously shifts the RGB color channels."
			},
			"Key": "59887519433F49DCBFC114AAC5E9B98E"
		},
		{
			"Source":
			{
				"Text": "做了错误操作没关系, 使用回溯就行了"
			},
			"Translation":
			{
				"Text": "Made a mistake? No problem. Just use the rewind feature."
			},
			"Key": "8FAF627444BFC49B06FE1891EF1FE81A"
		},
		{
			"Source":
			{
				"Text": "先使用Pref相机拍摄L_A2生成L_2_Photo后, 然后把L_N1的内容放进来."
			},
			"Translation":
			{
				"Text": "First, use the PhotoCatcherPref make L_A2_Photo from L_A2. Then, place the LevelInstance of L_N1 into it."
			},
			"Key": "68440DCB4620A12E173B479E74FF009D"
		},
		{
			"Source":
			{
				"Text": "关卡对应位置的地面上会有相应的讲解和提示."
			},
			"Translation":
			{
				"Text": "Explanations and hints are provided on the ground at relevant locations near each level."
			},
			"Key": "E3E0020449529321F844A2A32E73058E"
		},
		{
			"Source":
			{
				"Text": "关卡蓝图实现VFStepsRecordInterface, 回溯时卸载流式关卡."
			},
			"Translation":
			{
				"Text": "LevelBlueprint implements the VFStepsRecordInterface and unloads streamed levels during rewinding."
			},
			"Key": "725A200F4AD0FD2B2580D481FC9D38D9"
		},
		{
			"Source":
			{
				"Text": "其中两个墙体会挡住回来的路, 它们只在任一墙体触发后, 才会触发."
			},
			"Translation":
			{
				"Text": "Two walls will block the return path. They will only activate after any wall other than these two has been triggered."
			},
			"Key": "A85CA4DC442A6639427990B9E39A4546"
		},
		{
			"Source":
			{
				"Text": "其它要点信息:"
			},
			"Translation":
			{
				"Text": "Other key information:"
			},
			"Key": "315961584CC3AA04D98803B4D9E93899"
		},
		{
			"Source":
			{
				"Text": "其实你可以手持多个相机, 按F键在相机之间切换,"
			},
			"Translation":
			{
				"Text": "In fact, you can pick up multiple PhotoCatcher and press F to switch between them."
			},
			"Key": "37F03BA743F24C824D4AB495E7B35774"
		},
		{
			"Source":
			{
				"Text": "切换物品时都会移除后处理效果. 或者也可以回溯到拾起前."
			},
			"Translation":
			{
				"Text": "Post-process effect will be removed when switching items. Alternatively, you can rewind to before PhotoCatcher was picked up."
			},
			"Key": "0DFAAAF94800D683A9095594CEDC9F4A"
		},
		{
			"Source":
			{
				"Text": "切换相机, 切换相片, 以及本身人物, 都支持回溯."
			},
			"Translation":
			{
				"Text": "Switching PhotoCatchers, switching Photo2Ds, and even the character itself all support rewinding."
			},
			"Key": "2FC4C8474398D81B1D6C5F85EADB7284"
		},
		{
			"Source":
			{
				"Text": "前面场景中, 图案拓展的场景并没有完全符合照片, 即物体并没有被裁剪."
			},
			"Translation":
			{
				"Text": "In the previous levels, the Ulevel doesn't fully match the Projection — meaning the objects aren't clipped."
			},
			"Key": "9FFDC5BC4166F54A0B390FB20155A1A9"
		},
		{
			"Source":
			{
				"Text": "勾选后则只有查找到有Helper组件的Actor才会进入拍照流程(非侵入性)."
			},
			"Translation":
			{
				"Text": "When checked, only Actors with UHelperComponent will enter the photo-taking process (non-intrusive design)."
			},
			"Key": "89B046BB42B230002CCE838FF628A0F3"
		},
		{
			"Source":
			{
				"Text": "即也仅对携带Helper的物体进行覆盖."
			},
			"Translation":
			{
				"Text": "It means that only cut with actors with UHelperComponent."
			},
			"Key": "4DBD84D3469863B8143355A771B092FB"
		},
		{
			"Source":
			{
				"Text": "原因: Pref代码本身很复杂, 特殊处理也会越来越多, 难以维护"
			},
			"Translation":
			{
				"Text": "Reason: The VFPhotoCatcherPref's codes are inherently complex, and the accumulation of special-case handling would make it increasingly difficult to maintain."
			},
			"Key": "7BE30A28447353A43FD45980044AB80A"
		},
		{
			"Source":
			{
				"Text": "原因请看文档的\"制作预制照片\"和\"预制照片流程\"."
			},
			"Translation":
			{
				"Text": "For details, see the \"Prefabricating A Photo\" and \"Prefabricating Photo Flowchart\" sections in README."
			},
			"Key": "C841D98947B79C8D98BA459BC50C11AA"
		},
		{
			"Source":
			{
				"Text": "原游戏中, 有些物体与图案的转换是强顺序的,"
			},
			"Translation":
			{
				"Text": "In ViewFiner, the transformation between objects and projections follows a strict order."
			},
			"Key": "0E4843694985CB6D39544396D31F2F7D"
		},
		{
			"Source":
			{
				"Text": "原游戏中有使用图案拓展下一个, 带有图案且能继续拓展的场景"
			},
			"Translation":
			{
				"Text": "In ViewFinder, projection can extend a level, which contains another projection and can be extended."
			},
			"Key": "A3A89E3B4508F14A06C7FC9B6B2D889C"
		},
		{
			"Source":
			{
				"Text": "原游戏中的瞬移效果也已经实现, 试试把自己拍进去吧."
			},
			"Translation":
			{
				"Text": "The teleportation of player in the ViewFiner has also been implemented. Try taking a photo of yourself!"
			},
			"Key": "3AC03A124B7AA5A43963F1994322EA80"
		},
		{
			"Source":
			{
				"Text": "原游戏也有递归照片, 所以简化了其制作流程"
			},
			"Translation":
			{
				"Text": "ViewFiner also features recursive photo, so I've simplify its workflow."
			},
			"Key": "2EA381144876A2FD08A78EBA482AEF2B"
		},
		{
			"Source":
			{
				"Text": "只要愿意去细致的实现, 大多数功能都可以依赖Helper伪造完美复制."
			},
			"Translation":
			{
				"Text": "With UHelperComponent and thorough implementation, most gameplay features can be perfectly reproduced."
			},
			"Key": "F742A7AA466A387CB3B99CB6A49F9985"
		},
		{
			"Source":
			{
				"Text": "可以按X键放下手持相机, 相机的拾起和放下也支持回溯."
			},
			"Translation":
			{
				"Text": "You can press X to drop down the PhotoCatcher — both picking up and dropping down PhotoCatcher support rewinding."
			},
			"Key": "1D03C0034BDC8F480E3F198F28C50689"
		},
		{
			"Source":
			{
				"Text": "可以查看其Helper, 仅仅是为了不挡路."
			},
			"Translation":
			{
				"Text": "You can check its UHelperComponent, which exists solely to avoid blocking the path."
			},
			"Key": "C92F62714630DBD5D58F0DB3105DC41A"
		},
		{
			"Source":
			{
				"Text": "可以看到使用蓝图的, 比较复杂的改造示例."
			},
			"Translation":
			{
				"Text": "You can examine a complex modification example implemented with Blueprints."
			},
			"Key": "43C5D82641FEC6AAE688CD8C790885D0"
		},
		{
			"Source":
			{
				"Text": "可能还会有编辑器中的一些操作, 以体验工作流"
			},
			"Translation":
			{
				"Text": "Some editor-specific operations may be included to demonstrate the workflow."
			},
			"Key": "59A7113F41539DC212F4BBA5BB4890F9"
		},
		{
			"Source":
			{
				"Text": "可近距离查看天空盒背景, 它是生成的一个平面."
			},
			"Translation":
			{
				"Text": "You can view the skybox background up close — it's a procedurally generated plane(PlaneActor)."
			},
			"Key": "78EC4EEC40474882E48BEEBBF2B44373"
		},
		{
			"Source":
			{
				"Text": "右下方块: 不在照片中显示, 但进入拍照流程, 不会被照片切割."
			},
			"Translation":
			{
				"Text": "Bottom-right cube: Not visible in photo, but still enters the photo-taking process and will not be cut by Photo3D."
			},
			"Key": "0010111343CC529A0DCC31A2DDCB6C08"
		},
		{
			"Source":
			{
				"Text": "右边: 合适的位置和角度可以使透视图案变回物体."
			},
			"Translation":
			{
				"Text": "Right side: Finding the correct position and angle, it will revert projection back into an object."
			},
			"Key": "F0DEF06041977ABB389CD38E8FE01368"
		},
		{
			"Source":
			{
				"Text": "后处理材质为PPM_VirtualRender, 使用材质参数据更新摄像机位置."
			},
			"Translation":
			{
				"Text": "Post-process material used is PPM_VirtualRender, which utilizes a Material Parameter Collection to update the PhotoCatcher's position."
			},
			"Key": "497DF81F4F5E61A3294B98AD293C8E27"
		},
		{
			"Source":
			{
				"Text": "后面的方块中:"
			},
			"Translation":
			{
				"Text": "In the cubes behind:"
			},
			"Key": "432F7287443648A0B80D8AA9BA826748"
		},
		{
			"Source":
			{
				"Text": "启用所有墙体"
			},
			"Translation":
			{
				"Text": "Enable all walls."
			},
			"Key": "4CE4DF4D4DB511CA6B9C67A3DF01DFEC"
		},
		{
			"Source":
			{
				"Text": "哔哩哔哩: https://space.bilibili.com/239325439"
			},
			"Translation":
			{
				"Text": "Bilibili: https://space.bilibili.com/239325439"
			},
			"Key": "E8E461C44839EEEBA49E998FD91AD426"
		},
		{
			"Source":
			{
				"Text": "四个带有滤镜的滤镜, 从左往右的分别是:"
			},
			"Translation":
			{
				"Text": "Four PhotoCatcher with different filters are arranged from left to right."
			},
			"Key": "8412CC964BE5DC875EC4AA8A836B0D1D"
		},
		{
			"Source":
			{
				"Text": "回溯子系统只是框架, 理论上, 任何Actor都可以自行实现回溯."
			},
			"Translation":
			{
				"Text": "StepsRecorderWorldSubsystem is just a framework — theoretically, any Actor can implement its own rewind behavior."
			},
			"Key": "C53F206F4A5B15E0F0C629A2DDAAE7AF"
		},
		{
			"Source":
			{
				"Text": "回溯系统的tick有自己的频率, 回溯时可能回不到初始位置."
			},
			"Translation":
			{
				"Text": "The time rewind system operates on its own tick frequency. During rewinding, this may cause it to not return precisely to the original position."
			},
			"Key": "12FB52EB413A023D884F44B5E5B18687"
		},
		{
			"Source":
			{
				"Text": "图案只会投影到第一个表面."
			},
			"Translation":
			{
				"Text": "The projection image will only be projected onto the first surface encountered."
			},
			"Key": "A8D803BC41E978A76A59E8B97CE380E6"
		},
		{
			"Source":
			{
				"Text": "在L_A1同层级你能看到一个替身蓝图类"
			},
			"Translation":
			{
				"Text": "There is a StandIn Blueprint Class located in the same directory as L_A1."
			},
			"Key": "F30F21D84B3D2B7BA0D89C99BE31C0B1"
		},
		{
			"Source":
			{
				"Text": "在L_A7_Recursive再进行处理: 递归的位置, 关卡蓝图中委托的绑定等."
			},
			"Translation":
			{
				"Text": "Processing continues in L_A7_Recursive(LevelBlueprint), including: recursion location, Level Blueprint delegate bindings, and more."
			},
			"Key": "8B866BAB42FB231160F489AE76DFA546"
		},
		{
			"Source":
			{
				"Text": "在副本Actor拍照流程结束之前"
			},
			"Translation":
			{
				"Text": "Before the copied Actor's photo capture process ends"
			},
			"Key": "27D8F68B436C1253B415899C1649A34B"
		},
		{
			"Source":
			{
				"Text": "在副本Actor被Photo2D折叠之前"
			},
			"Translation":
			{
				"Text": "Before the copied Actor's photo-taking process ends."
			},
			"Key": "D5A614D547BC88F4F1E41CAFC957ECBA"
		},
		{
			"Source":
			{
				"Text": "在副本Actor被Photo2D放置流程结束之前"
			},
			"Translation":
			{
				"Text": "Before the copied Actor is folded up by Photo2D."
			},
			"Key": "F2F36AEA46EA574BC6347FB1E62ED71D"
		},
		{
			"Source":
			{
				"Text": "在副本Actor被Photo3D启用之前"
			},
			"Translation":
			{
				"Text": "Before the copied Actor is enabled by Photo3D."
			},
			"Key": "B459755A4842015C52E68882685E49E4"
		},
		{
			"Source":
			{
				"Text": "在副本Actor被布尔切割之前"
			},
			"Translation":
			{
				"Text": "Before the copied Actor is boolean cut."
			},
			"Key": "E8AB7D48407E353A31C35EA660CA6D44"
		},
		{
			"Source":
			{
				"Text": "在副本结束拍照流程前"
			},
			"Translation":
			{
				"Text": "Before the copied Actor ends the photo-taking process."
			},
			"Key": "91CF07DE41C6C8DB08899097B2BE858D"
		},
		{
			"Source":
			{
				"Text": "在原Actor使用动态网格替换前"
			},
			"Translation":
			{
				"Text": "Before the original Actor's UPrimitivesComponents are replaced with UVFDynamicMeshComponents."
			},
			"Key": "7E604E5644CCA7DD158281803201749A"
		},
		{
			"Source":
			{
				"Text": "在原Actor拍照流程开始前"
			},
			"Translation":
			{
				"Text": "Before the original Actor's photo-taking process starts."
			},
			"Key": "0595A44F43AA2768803392B9BFF1EDEF"
		},
		{
			"Source":
			{
				"Text": "在原Actor拍照流程结束之前"
			},
			"Translation":
			{
				"Text": "Before the original Actor's photo-taking process ends."
			},
			"Key": "D09C90F946E7ED721E10908E4061809A"
		},
		{
			"Source":
			{
				"Text": "在原Actor被Photo3D放置之前"
			},
			"Translation":
			{
				"Text": "Before the original Actor is placed down by Photo3D."
			},
			"Key": "92FD996D4DEC096C4FB90DA9AC8E38B5"
		},
		{
			"Source":
			{
				"Text": "在原Actor被切割之前"
			},
			"Translation":
			{
				"Text": "Before the original Actor is cut."
			},
			"Key": "4779BC1843505697E498DCA673F76B1C"
		},
		{
			"Source":
			{
				"Text": "在原Actor被复制之前"
			},
			"Translation":
			{
				"Text": "Before the original Actor is duplicated."
			},
			"Key": "50AE52BC4A0749F78BDC77A42C2334C7"
		},
		{
			"Source":
			{
				"Text": "在场景中放置合适的碰撞体积, 条件验证通过后调用PhotoDecal的\r\nReplaceWithDecal和RestoreWithActors."
			},
			"Translation":
			{
				"Text": "Place appropriate collision volumes in the scene. Once conditions are validated, call ReplaceWithDecal and RestoreWithActors on the PhotoDecal."
			},
			"Key": "C2ACE8DC477964FA11BE5C9427AC36B7"
		},
		{
			"Source":
			{
				"Text": "在奇数次时附加后处理效果, 偶数次则不会."
			},
			"Translation":
			{
				"Text": "Post-processing effect is applied on odd-numbered occurrences, but not on even-numbered ones."
			},
			"Key": "CDBD108D45FB0F59228185BEBD70FDA8"
		},
		{
			"Source":
			{
				"Text": "基础关卡0:"
			},
			"Translation":
			{
				"Text": "Basic Level 0:"
			},
			"Key": "E96F524741CE77DF2053289AEFB7AF95"
		},
		{
			"Source":
			{
				"Text": "基础关卡1:"
			},
			"Translation":
			{
				"Text": "Basic Level 1:"
			},
			"Key": "14158E77402613444B5253A6AAF48FFB"
		},
		{
			"Source":
			{
				"Text": "基础关卡2:"
			},
			"Translation":
			{
				"Text": "Basic Level 2:"
			},
			"Key": "ADCA153E4B4CB1B5AA99C783BF18D0E8"
		},
		{
			"Source":
			{
				"Text": "基础关卡3:"
			},
			"Translation":
			{
				"Text": "Basic Level 3:"
			},
			"Key": "0A2EA2464784C0771EDD2F863996605E"
		},
		{
			"Source":
			{
				"Text": "基础关卡4:"
			},
			"Translation":
			{
				"Text": "Basic Level 4:"
			},
			"Key": "A7D9EA224AEC38A2185D5FA86AC1A3C0"
		},
		{
			"Source":
			{
				"Text": "基础关卡5:"
			},
			"Translation":
			{
				"Text": "Basic Level 5:"
			},
			"Key": "6E6163954B13EC099AE079A6E64B0595"
		},
		{
			"Source":
			{
				"Text": "基础关卡6:"
			},
			"Translation":
			{
				"Text": "Basic Level 6:"
			},
			"Key": "83E867C440A2FE55B6201C8ADB3666EF"
		},
		{
			"Source":
			{
				"Text": "基础关卡7:"
			},
			"Translation":
			{
				"Text": "Basic Level 7:"
			},
			"Key": "8046745F4B3A87AC1C0A31B3262FD2EC"
		},
		{
			"Source":
			{
				"Text": "复刻游戏ViewFinder的大部分机制."
			},
			"Translation":
			{
				"Text": "Reproduce most of gameplay mechanics of ViewFinder."
			},
			"Key": "B8DAB5264EC4DFBFF7C738B5103F2550"
		},
		{
			"Source":
			{
				"Text": "失真效果会随着拍照次数增多而更加明显."
			},
			"Translation":
			{
				"Text": "The distortion effect becomes more pronounced as the number of being taken in photo increases."
			},
			"Key": "BD59931241BA2C3D8A9949804B4E7D17"
		},
		{
			"Source":
			{
				"Text": "如果你删除了天空盒大气等Actor, 你生成照片场景的背景可能是一片黑."
			},
			"Translation":
			{
				"Text": "If you delete Actors like the ExponentialHeightFog and atmospheres(and so on). The background of your generated photo imgae may be pure black."
			},
			"Key": "40BECD8544EA908B64D0BE9238167186"
		},
		{
			"Source":
			{
				"Text": "如果你敏锐的话, 你还能发现方块瞬移之后的位置回溯其实有些问题."
			},
			"Translation":
			{
				"Text": "If you're observant, you might notice that the cube's position after teleportation isn't quite accurate during the rewind."
			},
			"Key": "FFBD6687422D85A3B7862CAF3A6077B8"
		},
		{
			"Source":
			{
				"Text": "如果你玩过OuterWilds, 你肯定秒懂我的想法"
			},
			"Translation":
			{
				"Text": "If you've played Outer Wilds, you'll instantly get what I've done."
			},
			"Key": "AA43896542D02B29EB4F9DBA2446EF83"
		},
		{
			"Source":
			{
				"Text": "如果你观察仔细, 你能发现在L_N3_Photo中, 相机多了个组件."
			},
			"Translation":
			{
				"Text": "If you look closely, you'll notice PhotoCatcher in L_N3_Photo has an additional component."
			},
			"Key": "F022C9EA4BEF90716B7FECB5A9085EE3"
		},
		{
			"Source":
			{
				"Text": "它们没有任何特殊处理."
			},
			"Translation":
			{
				"Text": "No special processing is applied to them."
			},
			"Key": "8489E734457200719C12BFA8AA69BDD4"
		},
		{
			"Source":
			{
				"Text": "它会在交互(按E键)后3秒后进行拍照."
			},
			"Translation":
			{
				"Text": "It will automatically take a photo 3 seconds after interaction (E key press)."
			},
			"Key": "95B9BDD84AA2638943171F8E32F9CA97"
		},
		{
			"Source":
			{
				"Text": "它会自动向VFStepsRecorderWorldSubsystem注册, 自动支持回溯."
			},
			"Translation":
			{
				"Text": "It automatically registers with the VFStepsRecorderWorldSubsystem and inherently supports rewinding."
			},
			"Key": "AAE8099F48D47A3937E9BD8138BE8DFE"
		},
		{
			"Source":
			{
				"Text": "它既可以对所有的静态网格进行处理, 墙后的物体也有自定义的表现."
			},
			"Translation":
			{
				"Text": "It can process all UStaticMeshComponents uniformly, while allowing custom behaviors for objects behind walls."
			},
			"Key": "17B95BF64A6007FB3371CF9EE445464C"
		},
		{
			"Source":
			{
				"Text": "定时拍照"
			},
			"Translation":
			{
				"Text": "Take Photo with Timer"
			},
			"Key": "3C0557D3421009E5C15FA2B85FBDED2A"
		},
		{
			"Source":
			{
				"Text": "对上一关卡的相机进行拍照, 看它能否正常运行."
			},
			"Translation":
			{
				"Text": "Try taking photo of PhotoCatcher from the previous level to see if it still functions correctly."
			},
			"Key": "D04D7E9C40D100893584609A1DCF267C"
		},
		{
			"Source":
			{
				"Text": "对于相同的stencil值, 滤镜有不同的效果,"
			},
			"Translation":
			{
				"Text": "For the same stencil value, filters can produce different effects."
			},
			"Key": "C5D551E54D479744DB3C97BF8AC60E08"
		},
		{
			"Source":
			{
				"Text": "对物理方块拍照, 然后放置照片."
			},
			"Translation":
			{
				"Text": "Take a photo of physicsal cube, and then place the photo."
			},
			"Key": "0A0E91BC4F904574A088BD90C2E690AE"
		},
		{
			"Source":
			{
				"Text": "对部分进行拍照, 查看其物理效果, 支持回溯."
			},
			"Translation":
			{
				"Text": "Take photo of Part of them to observe their physical interactions — all supported time rewind."
			},
			"Key": "9347030C4507EB2B8E567798FF9FB284"
		},
		{
			"Source":
			{
				"Text": "尝试修改Helper的各种属性, 查看其表现."
			},
			"Translation":
			{
				"Text": "Try modifying the various properties of UHelperComponent and observe the results."
			},
			"Key": "ECF3E4494F338FB569D1CC942536A2B6"
		},
		{
			"Source":
			{
				"Text": "尝试去对前面关卡的物体进行拍摄, 看看会发生什么."
			},
			"Translation":
			{
				"Text": "Try taking photo of objects from previous levels and see what happens."
			},
			"Key": "2F8130B6454A8CE1F0499A9D0FB3105F"
		},
		{
			"Source":
			{
				"Text": "左下方块: 在照片中显示, 进入拍照流程, 可以被照片切割."
			},
			"Translation":
			{
				"Text": "Bottom-left cube: Visible in photo, enters the photo-taking process, and can be cut by Photo3D."
			},
			"Key": "CF523AB04A6644E94DE106A1AA17AF45"
		},
		{
			"Source":
			{
				"Text": "左边: 当处于两个柱子中间的时候, 会将圆柱体变成透视图案."
			},
			"Translation":
			{
				"Text": "Left side: When standing between the two pillars, the cylinder transforms into a projection."
			},
			"Key": "B3C8CD84448CBBA01FE7C8B70DCA0CFA"
		},
		{
			"Source":
			{
				"Text": "已启用所有墙体."
			},
			"Translation":
			{
				"Text": "All walls are enabled."
			},
			"Key": "454D55364FDCC2A885B1918D12EA3CBE"
		},
		{
			"Source":
			{
				"Text": "已经放置照片了? 回溯再来."
			},
			"Translation":
			{
				"Text": "Already placed a photo? Rewind and try again."
			},
			"Key": "8F4A1781403EA8646F45E4BD4683FE39"
		},
		{
			"Source":
			{
				"Text": "已重置所有墙体."
			},
			"Translation":
			{
				"Text": "All walls are reset."
			},
			"Key": "BFFCF26849E78C2459FF5590FA04D95C"
		},
		{
			"Source":
			{
				"Text": "干脆直接在_Photo中进行更改, 然后用Pref相机的CallInEditor函数"
			},
			"Translation":
			{
				"Text": "Simply make changes directly in _Photo ULevel, then use the PhotoCatcherPref's CallInEditor function."
			},
			"Key": "601BD0D442B8EA1E43FB678DAE80C27B"
		},
		{
			"Source":
			{
				"Text": "平台上有多个墙体, 在你靠近它的时候会出现, 这是个小迷宫."
			},
			"Translation":
			{
				"Text": "The platform features multiple walls that appear as you approach them, creating a small maze."
			},
			"Key": "E2E340344768B1DAF1CED7B2D68DB35E"
		},
		{
			"Source":
			{
				"Text": "并将阻碍的墙体给破坏掉."
			},
			"Translation":
			{
				"Text": "And it will break through the obstructing wall."
			},
			"Key": "85759A9F4214C740F8426F847918EAA5"
		},
		{
			"Source":
			{
				"Text": "底层依赖:"
			},
			"Translation":
			{
				"Text": "Dependence on:"
			},
			"Key": "F633D1244F05C5586677B9AA855C7226"
		},
		{
			"Source":
			{
				"Text": "当bOnlyOverlapWithHelper为false, 所有的物体都会进入拍照流程."
			},
			"Translation":
			{
				"Text": "When bOnlyOverlapWithHelper is false, all objects will enter the photo-taking process."
			},
			"Key": "911E8E0E4759FCA683E5428DDE85B4DE"
		},
		{
			"Source":
			{
				"Text": "当拓展出场景时, 再加载一个场景实例, 设置好相对位置."
			},
			"Translation":
			{
				"Text": "When extending a ULevel, load an additional ULevelinstance and set its relative position."
			},
			"Key": "0BBA3EB04C305ABA80EB59BA8A1FCC17"
		},
		{
			"Source":
			{
				"Text": "得益于动态网格, 视锥并非是模型,而是根据参数计算生成的."
			},
			"Translation":
			{
				"Text": "Thanks to the dynamic mesh, the ViewFrustum isn't a model but is generated through parameter-based calculations."
			},
			"Key": "429D036F4FCCE3FE4E4E2E81FB6D2E19"
		},
		{
			"Source":
			{
				"Text": "成员变量LocalPool提供UDynamicMesh级别的对象池"
			},
			"Translation":
			{
				"Text": "The member variable LocalPool provides pooling of UDynamicMesh."
			},
			"Key": "66DF53F446A7872D96C9A38BC1FF36B0"
		},
		{
			"Source":
			{
				"Text": "或者使用不冲突的stencil值, 对应多个效果."
			},
			"Translation":
			{
				"Text": "Alternatively, use non-conflicting stencil values to map to multiple effects."
			},
			"Key": "8D15FE6047636DA388127E90862551A7"
		},
		{
			"Source":
			{
				"Text": "打开L_Demo的关卡蓝图, 在BeginPlay中有组件池的预生成"
			},
			"Translation":
			{
				"Text": "Open the LevelBlueprint of L_Demo. In the BeginPlay event, you'll find the pre-population setup for the component pool."
			},
			"Key": "A20924884A8BE15462F168B98F0A9215"
		},
		{
			"Source":
			{
				"Text": "打开L_N1, 选中AVFPhotoCatcherPref, 切换到ViewFinderRe属性分段,"
			},
			"Translation":
			{
				"Text": "Open L_N1, select the AVFPhotoCatcherPref, and switch to the ViewFinderRe property section."
			},
			"Key": "86443CB045474F0AB9E9438E1F7277E0"
		},
		{
			"Source":
			{
				"Text": "找到合适的位置和角度, 里面是一个被裁剪的, 且递归的场景."
			},
			"Translation":
			{
				"Text": "Find the right position and angle — it's a clipped, recursive ULevel inside."
			},
			"Key": "CCB0DD3C45639B2F42F271A5DCB93EFB"
		},
		{
			"Source":
			{
				"Text": "拍照会将照片里面的物体也带上滤镜. "
			},
			"Translation":
			{
				"Text": "Take a photo of Photo2D also applies the filter effect to the meshes within the Photo3D."
			},
			"Key": "E65E8B7C44925A5A7CAACEB1B62D5F72"
		},
		{
			"Source":
			{
				"Text": "拍照后使用UVFDMSteppableComponent, 且开启物理模拟"
			},
			"Translation":
			{
				"Text": "After taking photo, use the UVFDMSteppableComponent with physics simulation enabled."
			},
			"Key": "D523F51F4EB6B49244FA589C04635517"
		},
		{
			"Source":
			{
				"Text": "拍照流程在AVFPhotoCatcher::TakeAPhoto_Implementation(), 简单总结是:"
			},
			"Translation":
			{
				"Text": "The photo-taking process is implemented in AVFPhotoCatcher::TakeAPhoto_Implementation(). The core process is briefly summarized as follows:"
			},
			"Key": "1C3099B64C88E34C9751318302FC61E5"
		},
		{
			"Source":
			{
				"Text": "拍照然后放置照片, 远处的物体会被覆盖另外的材质,"
			},
			"Translation":
			{
				"Text": "After taking a photo and placing it, distant objects appear to have their materials overridden."
			},
			"Key": "6598668144687EA0523EF8AC4BF3A338"
		},
		{
			"Source":
			{
				"Text": "拍照部分: 基于动态网格体, 插件GeometryScript(可剥离)."
			},
			"Translation":
			{
				"Text": "Object-Photo transformation: Based on UDynamicMeshComponent, the plugin GeometryScripting (decomposable)."
			},
			"Key": "F92207274732696D920D71A4C8EEF656"
		},
		{
			"Source":
			{
				"Text": "拓展出的场景中:"
			},
			"Translation":
			{
				"Text": "In the extended ULevel:"
			},
			"Key": "E338DBE343D25CDF3035CF8BF9690EBA"
		},
		{
			"Source":
			{
				"Text": "拾取照片"
			},
			"Translation":
			{
				"Text": "Pick up Photo"
			},
			"Key": "0B7C70334EE409AA5C3740A8509B33AD"
		},
		{
			"Source":
			{
				"Text": "拾取相机"
			},
			"Translation":
			{
				"Text": "Pick up PhotoCatcher"
			},
			"Key": "570BBFE64845390ACA676E9A1597660B"
		},
		{
			"Source":
			{
				"Text": "按F切换相机和照片."
			},
			"Translation":
			{
				"Text": "Press F to switch between the PhotoCatcher and Photo2Ds."
			},
			"Key": "0C245309474CEFAB6C4C14823E2C389E"
		},
		{
			"Source":
			{
				"Text": "按F键切换相机时, 也会自动往Pawn相机装/卸后处理,"
			},
			"Translation":
			{
				"Text": "Switching cameras with the F key automatically applies or removes the post-processing effects on the Pawn's camera."
			},
			"Key": "734AA3CA4F3EAA0FB2301B8B546F74E2"
		},
		{
			"Source":
			{
				"Text": "按Q切换照片, 按F切换身上的物品,"
			},
			"Translation":
			{
				"Text": "Press Q to switch between photos; Press F to cycle through equipped items."
			},
			"Key": "8A92167C4E21C8AA5D134DA64FC513B0"
		},
		{
			"Source":
			{
				"Text": "按Q键可以在照片间切换."
			},
			"Translation":
			{
				"Text": "Press Q to switch between Photo2Ds."
			},
			"Key": "63BB1E734F2D26C387F0E98A63C76C7B"
		},
		{
			"Source":
			{
				"Text": "捕获源使用SCS_SceneColorSceneDepth, 以防止两次后处理效果"
			},
			"Translation":
			{
				"Text": "\"CaptureSource\" is set to SCS_SceneColorSceneDepth to prevent (twice) post-processing effects."
			},
			"Key": "63C0D84644E3C66D01AD16B877DD974C"
		},
		{
			"Source":
			{
				"Text": "描边: 根据Stencil值决定描边像素值."
			},
			"Translation":
			{
				"Text": "Outline: Outline pixel value determined by the Stencil value."
			},
			"Key": "5DB2B9DC48CBF56E223F4A8B3C2E6315"
		},
		{
			"Source":
			{
				"Text": "操作指南:"
			},
			"Translation":
			{
				"Text": "Keyboard Controls Guide"
			},
			"Key": "10CF7BFD428644CE829DF98DF29273D0"
		},
		{
			"Source":
			{
				"Text": "支持回溯."
			},
			"Translation":
			{
				"Text": "Time Rewind Supported."
			},
			"Key": "9B5806614665529758E94D9EF5090AA7"
		},
		{
			"Source":
			{
				"Text": "支持回溯."
			},
			"Translation":
			{
				"Text": "Time Rewind Supported."
			},
			"Key": "3E7B864343B09B381140C294327B2EAF"
		},
		{
			"Source":
			{
				"Text": "支持回溯."
			},
			"Translation":
			{
				"Text": "Time Rewind Supported."
			},
			"Key": "7C74453E452ADCDA72AE2F9ABBBFC18D"
		},
		{
			"Source":
			{
				"Text": "支持回溯的替身类则是AVFPawnStandInSteppable."
			},
			"Translation":
			{
				"Text": "The StandIn class supporting time rewind: AVFPawnStandInSteppable."
			},
			"Key": "B70D316F453FA09523A3399E888D575B"
		},
		{
			"Source":
			{
				"Text": "支持静态网格体, 其它未测试."
			},
			"Translation":
			{
				"Text": "Supports UStaticMeshComponent. Others have not been tested."
			},
			"Key": "68EDE4AB47E1E60FC9DE1BB488F4B4B1"
		},
		{
			"Source":
			{
				"Text": "改动下视锥参数, 试试不同的视锥."
			},
			"Translation":
			{
				"Text": "Modify ViewFrustum parameters and experiment with different ViewFrustums."
			},
			"Key": "6962E1AC4A6622E7435CF88B5F4CE988"
		},
		{
			"Source":
			{
				"Text": "放置时不会切割其他物体, 因为Photo3D取消勾选了bCuttingOthers"
			},
			"Translation":
			{
				"Text": "When placed, it will not cut other meshes because the bCuttingOthers of Photo3D is false."
			},
			"Key": "497A555E45ADDBC22CD747A6A114DB9C"
		},
		{
			"Source":
			{
				"Text": "放置照片时, Photo3D也会跟随相机设置的仅对Helper生效,"
			},
			"Translation":
			{
				"Text": "When placing a Photo2D, the Photo3D also follows the PhotoCatcher's setting of \"Only Overlap with Helper\"."
			},
			"Key": "19EF92D4448CFDA8CAB7DDBBA0BDE073"
		},
		{
			"Source":
			{
				"Text": "放置照片流程在AVFPhoto3D::PlaceDown(), 简单总结是:"
			},
			"Translation":
			{
				"Text": "Photo3D Placement workflow locates in AVFPhoto3D::PlaceDown(). It can be summarized as follows:"
			},
			"Key": "68259CC647658DC6F96D11AFB433AAD0"
		},
		{
			"Source":
			{
				"Text": "放置相片后拾取手持相机."
			},
			"Translation":
			{
				"Text": "After placing Photo2D. pick up the PhotoCatcher inside."
			},
			"Key": "472EFE2249E49ED348F53C9B5A68B59F"
		},
		{
			"Source":
			{
				"Text": "文件夹Plugins/ViewFinderRe/Content/Blueprints/PhotoDeca下,"
			},
			"Translation":
			{
				"Text": "In the folder Plugins/ViewFinderRe/Content/Blueprints/PhotoDeca:"
			},
			"Key": "C7834327475B99D562277A8081999148"
		},
		{
			"Source":
			{
				"Text": "方块蓝图类位于L_A3同层级下, 会在已有的所有的动态多播都进行屏幕打印"
			},
			"Translation":
			{
				"Text": "The cube blueprint class locates in the same directory as L_A3. It will print logs for all existing dynamic multicast events."
			},
			"Key": "FF833C0A4CD7BBD5BEFFCDA5C7402BF0"
		},
		{
			"Source":
			{
				"Text": "时间:"
			},
			"Translation":
			{
				"Text": "Time:"
			},
			"Key": "1823EBD649AF71D487377D908B42AA0F"
		},
		{
			"Source":
			{
				"Text": "时间回溯: 基于世界子系统."
			},
			"Translation":
			{
				"Text": "Time Rewind: Based on UWorldSubsystem."
			},
			"Key": "BBB0446E45CD2C26706487AD313927CB"
		},
		{
			"Source":
			{
				"Text": "暖色: 随着拍照次数越来越暖色."
			},
			"Translation":
			{
				"Text": "Warm Tones: Grows warmer with each photo taken."
			},
			"Key": "642FF96A4205337484F2A6ACAAE99192"
		},
		{
			"Source":
			{
				"Text": "更多查看README的\"图案颜色不匹配\"部分"
			},
			"Translation":
			{
				"Text": "For more, see the \"Projection Color Mismatch\" section in README."
			},
			"Key": "B2296C3044E2CB21AB8CB1807E1C7DFE"
		},
		{
			"Source":
			{
				"Text": "更多请参看项目README"
			},
			"Translation":
			{
				"Text": "For more, please refer to the project README."
			},
			"Key": "4718014F478D21C9F5FFEE90A0D20692"
		},
		{
			"Source":
			{
				"Text": "更早的初版: https://github.com/StrangeDS/ViewFinderReSource"
			},
			"Translation":
			{
				"Text": "Earlier initial version: https://github.com/StrangeDS/ViewFinderReSource"
			},
			"Key": "F50874CF4DF94774AFEB39B1EEC5509F"
		},
		{
			"Source":
			{
				"Text": "更细致的流程请查看README的“核心流程”部分"
			},
			"Translation":
			{
				"Text": "For more detail, please see the \"Core Processes\" section in README."
			},
			"Key": "1827E98745BC71EA98EACFA227C4DE58"
		},
		{
			"Source":
			{
				"Text": "有一个墙体不会被拍照复制, 这是正常的,"
			},
			"Translation":
			{
				"Text": "One wall of them will not duplicated when taken in photo. This is intentional."
			},
			"Key": "1EC862F643789CCC14072BB2FCD98A66"
		},
		{
			"Source":
			{
				"Text": "条件有限, 只测试了Windows平台."
			},
			"Translation":
			{
				"Text": "Limited by resources, only the Windows platform has been tested."
			},
			"Key": "341F735A42DB03C5FE1D109D8BF5CC38"
		},
		{
			"Source":
			{
				"Text": "来让方块不支持回溯"
			},
			"Translation":
			{
				"Text": "It prevents the cubes from being rewound."
			},
			"Key": "AE3D557C462A6B7BB35A5CB90149E222"
		},
		{
			"Source":
			{
				"Text": "查看L_A2与L_A2_Photo, 前者是搭建的场景, 后者是生成的照片场景"
			},
			"Translation":
			{
				"Text": "Refer to L_A2 and L_A2_Photo. The former is a manually constructed ULevel, while the latter is the photo ULevel."
			},
			"Key": "307DBF004B836462AEB8BCB306170F7F"
		},
		{
			"Source":
			{
				"Text": "查看L_A4, 在场景中放置了一个BP_Photo2D_Interact(需要交互),"
			},
			"Translation":
			{
				"Text": "See L_A4: A BP_Photo2D_Interact intance (requires player to interact) has been placed in the scene."
			},
			"Key": "EE84CBBA4C34759B08711FAAD73B8BD7"
		},
		{
			"Source":
			{
				"Text": "查看L_A5的关卡蓝图及同层级的BP_WallCloseTo,"
			},
			"Translation":
			{
				"Text": "Refer to the L_A5's Level Blueprint and the BP_WallCloseTo blueprint located at the same as L_A5."
			},
			"Key": "4CB292C44E757C8ABF284EA133733A82"
		},
		{
			"Source":
			{
				"Text": "查看L_A7同层级文件夹下的文件."
			},
			"Translation":
			{
				"Text": "Check the files in the same folder location as L_A7."
			},
			"Key": "F11B516B49BAA97412B0A090CDEB1BC3"
		},
		{
			"Source":
			{
				"Text": "查看其Helper组件, 它被设计为不参与拍照流程, 你需要手动再放置一个."
			},
			"Translation":
			{
				"Text": "Check its Helper component — it's designed to be excluded from the photo-taking process, so you'll need to manually place another one."
			},
			"Key": "070C70274A0CDCA2FBC31EAEA09FA64F"
		},
		{
			"Source":
			{
				"Text": "没有做影印机, 原因很简单, 照片也可以通过拍照来复制."
			},
			"Translation":
			{
				"Text": "A photocopier wasn't implemented for a simple reason: Photo2Ds can already be duplicated by taking photh of them."
			},
			"Key": "11AC207E4DEC3F7C84E0A58427EF7803"
		},
		{
			"Source":
			{
				"Text": "游玩所有内容, 流程在20分钟."
			},
			"Translation":
			{
				"Text": "A full playthrough of all content can be completed in about 20 minutes."
			},
			"Key": "FFF185F349AA1B735630F48828000CDC"
		},
		{
			"Source":
			{
				"Text": "滤镜: 自定义深度模板和后处理."
			},
			"Translation":
			{
				"Text": "Filter: Based on Custom Depth-Stencil and Post Processing."
			},
			"Key": "2D0B331A4400D70A59294EA5B2B2A47F"
		},
		{
			"Source":
			{
				"Text": "滤镜影响照片内的物体, 实现依然依赖Helper组件, 思路为:"
			},
			"Translation":
			{
				"Text": "Filter affects objects within the photo. Its implementation still relies on the UHelperComponent, with the core approach being:"
			},
			"Key": "E6C0DDB7469E172B9A045088623DE3A8"
		},
		{
			"Source":
			{
				"Text": "滤镜的设置在组件UVFPostProcessComponent上:"
			},
			"Translation":
			{
				"Text": "Filter settings are configured on UVFPostProcessComponent:"
			},
			"Key": "B49B156F4550EBBB5FCB0F8541D475BA"
		},
		{
			"Source":
			{
				"Text": "灰度: 固定灰度."
			},
			"Translation":
			{
				"Text": "Grayscale: Fixed grayscale value."
			},
			"Key": "853F67B8426F394921F2239E3D566B5A"
		},
		{
			"Source":
			{
				"Text": "点击PrefabricateAPhotoLevel按钮进行预制照片, 选择生成的位置,"
			},
			"Translation":
			{
				"Text": "Click the PrefabricateAPhotoLevel button to prefabricate a photo, and select file path."
			},
			"Key": "3ACF58894D303FB11F4FB8AE216FCCA1"
		},
		{
			"Source":
			{
				"Text": "然后PrefabricateAPhotoLevel重新生成或者UpdateMIC更新图案就可以了"
			},
			"Translation":
			{
				"Text": "Then simply regenerate ULevel with PrefabricateAPhotoLevel, or update the texture using UpdateMIC."
			},
			"Key": "9372B546488ED6E7979AE6BA87D6773E"
		},
		{
			"Source":
			{
				"Text": "然后只拍摄(使用Pref的ActorsToIgnore)递归的物体到L_A7_Recursive,"
			},
			"Translation":
			{
				"Text": "Then, prefabricate only the recursive objects (using Pref's ActorsToIgnore) to L_A7_Recursive."
			},
			"Key": "CD6229824572267B450F6985063F6AE7"
		},
		{
			"Source":
			{
				"Text": "然后设置其属性IsRecursice为true, 就可使用BP_PhotoCatcherPref进行拍照了."
			},
			"Translation":
			{
				"Text": "Then, set its \"IsRecursive\" to true, and you can take photos using BP_PhotoCatcherPref."
			},
			"Key": "92EE416F4D0476642E29B2B0E3379389"
		},
		{
			"Source":
			{
				"Text": "然后遍历内部Actors上的组件, 进行后处理流程."
			},
			"Translation":
			{
				"Text": "It then iterates through the UPrimitiveComponents on these internal Actors and update their stencil."
			},
			"Key": "FD233AFD44CC4E51054E5DA3762C9BAC"
		},
		{
			"Source":
			{
				"Text": "照片里面有一个手持相机和一张照片."
			},
			"Translation":
			{
				"Text": "Inside the Photo2D, there is a pickable PhotoCatcher and another Photo2D."
			},
			"Key": "FD350BDC4415DEE8E3948D8EA71C66A0"
		},
		{
			"Source":
			{
				"Text": "物体与图案转换都有对应的委托, 可以按需去绑定."
			},
			"Translation":
			{
				"Text": "Transformation between object and projections contains their own delegates, which can be bound as needed."
			},
			"Key": "BF2877624818A552B4338490EE64A48C"
		},
		{
			"Source":
			{
				"Text": "物体与透视图片: 基于贴花."
			},
			"Translation":
			{
				"Text": "Object-Projection transformation: Based on Decal."
			},
			"Key": "048BCEB04344270E3FCD779A0D166B03"
		},
		{
			"Source":
			{
				"Text": "物理方块在被拍照时, 会生成一个替身对象, 之后的流程都将由替身进行."
			},
			"Translation":
			{
				"Text": "During photo-taking process, will generate a StandIn instance for cube. The subsequent process will then be taken over by it."
			},
			"Key": "810DBCCA446D7E91A6FB2DAD5A3F0E0E"
		},
		{
			"Source":
			{
				"Text": "玩家操作的角色的替身类为AVFPawnStandIn,"
			},
			"Translation":
			{
				"Text": "The StandIn Class for player's pawn is AVFPawnStandIn,"
			},
			"Key": "F670E12E4216B281BCCDDBB29EBB915B"
		},
		{
			"Source":
			{
				"Text": "理论上现有的委托能覆盖实现原游戏中的相关所有玩法."
			},
			"Translation":
			{
				"Text": "Theoretically, the existing delegates can cover the ViewFiner's mechanics."
			},
			"Key": "1FBC3C8946599D9EAFBCAAA1455D6272"
		},
		{
			"Source":
			{
				"Text": "相机与其它物体一样, 都可以被拍照."
			},
			"Translation":
			{
				"Text": "Like other objects, the camera itself can be taken in photo."
			},
			"Key": "01EED9304B5E92F385E897A91F494C0A"
		},
		{
			"Source":
			{
				"Text": "相机的bGenerateAPlaneActor为false, 就不会生成背景图案."
			},
			"Translation":
			{
				"Text": "With PhotoCatcher's bGenerateAPlaneActor set to false, it won't generate PlaneActor."
			},
			"Key": "7BBD12B349383EB15B69C0B68E67F381"
		},
		{
			"Source":
			{
				"Text": "相机被丢弃时:"
			},
			"Translation":
			{
				"Text": "When PhotoCatcher dropped down:"
			},
			"Key": "D8D7FD964F02D0182DECB4A55AB1FAC6"
		},
		{
			"Source":
			{
				"Text": "相机设置了剪切, 且仅对Helper组件的物体生效."
			},
			"Translation":
			{
				"Text": "PhotoCatcher has set \"bCuttingOrignal\" as true, meaning only process actors with UHelperComponent."
			},
			"Key": "8E8FB195458F04D51E3803A67A93DC99"
		},
		{
			"Source":
			{
				"Text": "移动: WASD"
			},
			"Translation":
			{
				"Text": "Move: WASD"
			},
			"Key": "A7D9160E425300797572A4A94D1123C5"
		},
		{
			"Source":
			{
				"Text": "站到这里"
			},
			"Translation":
			{
				"Text": "Stand here."
			},
			"Key": "2AB7DB7643B645295E0FFFBC31C0973F"
		},
		{
			"Source":
			{
				"Text": "站到这里"
			},
			"Translation":
			{
				"Text": "Stand here."
			},
			"Key": "3B8E28DB4B2C668E46B44BABC9C8D328"
		},
		{
			"Source":
			{
				"Text": "组件UVFDMSteppableComponent除了自动注册Transform的回溯之外"
			},
			"Translation":
			{
				"Text": "UVFDMSteppableComponent handles automatic Transform registration for rewinding."
			},
			"Key": "818DBBAC436F2E608AF1C4A9E19CDE87"
		},
		{
			"Source":
			{
				"Text": "编辑器中处理就很麻烦, 没有子系统"
			},
			"Translation":
			{
				"Text": "In Editor (World), handling this is more complex as the Subsystem is unavailable."
			},
			"Key": "16F7E1B24F0A5F60A5A72FA6DF75FEBE"
		},
		{
			"Source":
			{
				"Text": "编辑器中打开项目设置, 在\"插件\"容器下,  找到ViewFinderReSettings类别"
			},
			"Translation":
			{
				"Text": "In Editor, open ProjectSettings and locate the \"ViewFinderReSettings\" category under the \"Plugins\" section."
			},
			"Key": "35588D3C44C301D235758BAFA4858997"
		},
		{
			"Source":
			{
				"Text": "设置个名称, 然后确定就完事啦."
			},
			"Translation":
			{
				"Text": "Set a name, and you're done!"
			},
			"Key": "1864E30145D83F1F8FF2228B7D74C033"
		},
		{
			"Source":
			{
				"Text": "试着修改AVFTransfromRecorderActor的Box组件位置"
			},
			"Translation":
			{
				"Text": "Try adjusting the position of the UBoxComponent in AVFTransfromRecorderActor."
			},
			"Key": "E6127E8E4E9F868D3A0E6A8157FFFAD0"
		},
		{
			"Source":
			{
				"Text": "试着用固定相机拍些东西. 你可以回溯到放置前重新调整位置,"
			},
			"Translation":
			{
				"Text": "Try taking photos with the fixed camera. You can rewind to before placement to readjust its position."
			},
			"Key": "844E0E7D45DC25ED58EAF2939780C364"
		},
		{
			"Source":
			{
				"Text": "试着让方块掉下来:"
			},
			"Translation":
			{
				"Text": "Try making the cubes fall:"
			},
			"Key": "1EF9F2A44C04EC41A79D9EA07214D641"
		},
		{
			"Source":
			{
				"Text": "试试对相机拍照, 只有一部分能不能正常运行(能)."
			},
			"Translation":
			{
				"Text": "Try taking a photo of PhotoCatcher — even if only partially remained, will it still function? (Yes.)"
			},
			"Key": "80B28CBB4B7322AF7DEE659AF4FE2812"
		},
		{
			"Source":
			{
				"Text": "试试将取出的方块推进里面."
			},
			"Translation":
			{
				"Text": "Try pushing the cube you retrieved inside."
			},
			"Key": "C410B3054C283E56448341844E1EB514"
		},
		{
			"Source":
			{
				"Text": "试试撞散它们, 然后长按R回溯."
			},
			"Translation":
			{
				"Text": "Try scattering them apart, then hold R to rewind."
			},
			"Key": "3BADBA9F4CCAAF3F47872BA4F91116A5"
		},
		{
			"Source":
			{
				"Text": "试试用它拍摄前面的小迷宫, 拍照出来的墙体依然还能有功能"
			},
			"Translation":
			{
				"Text": "Try taking photo of previous small maze. The walls is photo will retain their functionality after placed."
			},
			"Key": "C18378104413C3C00734A88CA4415E7C"
		},
		{
			"Source":
			{
				"Text": "请仅做学习用途, 开源协议: MPL2.0"
			},
			"Translation":
			{
				"Text": "Kindly use for study only. License: MPL2.0."
			},
			"Key": "69D73D084DE90C654A90D1B236E3E4B5"
		},
		{
			"Source":
			{
				"Text": "请先放下之前的相机, 不然会很乱."
			},
			"Translation":
			{
				"Text": "Please drop down any previous cameras first to avoid confusion."
			},
			"Key": "904F2B37434BF55EA64921B9CDA30658"
		},
		{
			"Source":
			{
				"Text": "贴花的效果有局限性:"
			},
			"Translation":
			{
				"Text": "The decal implementation has limitations:"
			},
			"Key": "AE62FED14351E217F8CAC0A729B845CA"
		},
		{
			"Source":
			{
				"Text": "运行时是通过世界子系统(VFBackgroundWorldSubsystem)获得需要捕捉的Actor."
			},
			"Translation":
			{
				"Text": "During runtime, acquires the Actors to be captured through the World Subsystem (VFBackgroundWorldSubsystem)."
			},
			"Key": "ADDD540E46D066A940DA07A8E277EFD5"
		},
		{
			"Source":
			{
				"Text": "还使用了双层对象池:"
			},
			"Translation":
			{
				"Text": "It also uses a two-tiered object pool:"
			},
			"Key": "5EB8D0384DD72A5857513CB0A27E36AD"
		},
		{
			"Source":
			{
				"Text": "这个手持相机设置了bCuttingOrignal为true,"
			},
			"Translation":
			{
				"Text": "This handheld PhotoCatcher has set bCuttingOrignal to true."
			},
			"Key": "091C6C7D40F39E926D69ADBCA9C9FC9A"
		},
		{
			"Source":
			{
				"Text": "这个相机勾选了bOnlyOverlapWithHelper. "
			},
			"Translation":
			{
				"Text": "This PhotoCatcher has bOnlyOverlapWithHelper enabled."
			},
			"Key": "B02682244BB5B46DE25DA28A6CEE9BE7"
		},
		{
			"Source":
			{
				"Text": "这个相机的FOV其实只有30°, 宽高比是1.6, 视锥远平面是5000cm."
			},
			"Translation":
			{
				"Text": "This PhotoCatcher actually has an FOV of only 30°, an aspect ratio of 1.6, and ViewFrustums's far plane of 5000cm."
			},
			"Key": "56EC3A674A30BF22F05118AA883D86CF"
		},
		{
			"Source":
			{
				"Text": "这个类实现了多个接口:"
			},
			"Translation":
			{
				"Text": "This class implements multiple interfaces:"
			},
			"Key": "B0AE0BE6463CC69818ED04901E72C844"
		},
		{
			"Source":
			{
				"Text": "这些实现耗心费力, 为了实现它们, 框架改了又改"
			},
			"Translation":
			{
				"Text": "The realization of these features demanded exhaustive effort, driving iterative framework modifications to achieve functional completeness."
			},
			"Key": "9F21CAF0444F798D45F2C88CCF697EA2"
		},
		{
			"Source":
			{
				"Text": "这意味着: 相机也能被切割."
			},
			"Translation":
			{
				"Text": "This means: the camera itself can also be cut."
			},
			"Key": "4CD5B3E04851CAC4D801DBA508761EAA"
		},
		{
			"Source":
			{
				"Text": "这时候拍照不再是复制, 而是剪切."
			},
			"Translation":
			{
				"Text": "In this mode, taking a photo no longer duplicates the scene — it cuts."
			},
			"Key": "37B0E7F547DC3DCAFFB407BD8B7F67AB"
		},
		{
			"Source":
			{
				"Text": "这是一张”递归“照片, 即里面还有一张相同的照片"
			},
			"Translation":
			{
				"Text": "This is a \"recursive\" photo — containing another identical instance of itself within it."
			},
			"Key": "57408E224F21AA3C6262D28E82387C3C"
		},
		{
			"Source":
			{
				"Text": "这是一种集成但耦合的做法, 更可能的流程是:"
			},
			"Translation":
			{
				"Text": "This is an integrated but coupled approach. A more feasible workflow would be:"
			},
			"Key": "E93C343249D776FE6EAA3D9F860492DE"
		},
		{
			"Source":
			{
				"Text": "这是三个基础物理方块, 它们的Transform和速度支持回溯."
			},
			"Translation":
			{
				"Text": "These are three basic physics-enabled cubes. Their transforms and velocity support time rewind."
			},
			"Key": "E4630D6B43158E1110FDAB8F8A3F7D7B"
		},
		{
			"Source":
			{
				"Text": "这里介绍替身机制:  "
			},
			"Translation":
			{
				"Text": "StandIn Mechanism: "
			},
			"Key": "B28CAE2D4C22E1F78827D5A9A8277E53"
		},
		{
			"Source":
			{
				"Text": "这里又有一张照片, 按Q键在照片间切换, 相片里面有一个固定相机,"
			},
			"Translation":
			{
				"Text": "Here is another photo — press Q to switch between photos. Inside it is a fixed camera."
			},
			"Key": "6DF6DD894B98C7E635031BBFF3B8FA37"
		},
		{
			"Source":
			{
				"Text": "这里完成了这个功能, 而且是更难的递归"
			},
			"Translation":
			{
				"Text": "This feature is implemented, including the more complex recursive behavior."
			},
			"Key": "98499A5243F1B6E60696C292A7D0B7E4"
		},
		{
			"Source":
			{
				"Text": "这里提供了很多项目级别的参数配置"
			},
			"Translation":
			{
				"Text": "A lot of project-level configuration parameters are provided here."
			},
			"Key": "B838174448956BB61B0850B1001EFCB2"
		},
		{
			"Source":
			{
				"Text": "这里有一个手持相机, 交互(按E键)拾起相机."
			},
			"Translation":
			{
				"Text": "Here is a handheld camera. Interact (press E) to pick it up."
			},
			"Key": "59BF902C4B6D43079333F89BE7B021FF"
		},
		{
			"Source":
			{
				"Text": "这里有一些较为高阶的实现."
			},
			"Translation":
			{
				"Text": "There are some more advanced levels."
			},
			"Key": "764323C24AB18CA8F48EB99AA33FBBE8"
		},
		{
			"Source":
			{
				"Text": "这里有一堵墙, 找到合适的位置和角度, 就会拓展出一个场景, "
			},
			"Translation":
			{
				"Text": "Here is a wall. Find the right position and angle, and it will extend into a new ULevel."
			},
			"Key": "1321E0714D977E5AEA4A5D93A0CCD2E8"
		},
		{
			"Source":
			{
				"Text": "这里有一张照片, 交互(按E键)拾起, 长按鼠标右键进行预览,"
			},
			"Translation":
			{
				"Text": "Here's a photo — press E to interact and pick it up, hold down right mouse button to preview."
			},
			"Key": "2D6CBFB747DCDC1C9512A6B463E452ED"
		},
		{
			"Source":
			{
				"Text": "这里有另一个手持相机,"
			},
			"Translation":
			{
				"Text": "There is another handheld camera here."
			},
			"Key": "80A1E0FC462C060FCBB771AC225AF5AB"
		},
		{
			"Source":
			{
				"Text": "这里的方块, 靠近会消失."
			},
			"Translation":
			{
				"Text": "The cube here will disappear when you approach them."
			},
			"Key": "77275D4A48EFC2F55F4B77A79D1E3657"
		},
		{
			"Source":
			{
				"Text": "这里的方块也是支持回溯的, 回溯看看方块是如何抽搐的吧."
			},
			"Translation":
			{
				"Text": "These cubes also support rewinding — try it to see how they jitter!"
			},
			"Key": "D79E792049BA3E5611AF498E81042AE6"
		},
		{
			"Source":
			{
				"Text": "这里还有:"
			},
			"Translation":
			{
				"Text": "And there are:"
			},
			"Key": "BBDECCDE4A614DCC18C22F9F6CBEB0C5"
		},
		{
			"Source":
			{
				"Text": "进阶关卡1:"
			},
			"Translation":
			{
				"Text": "Advanced Level 1:"
			},
			"Key": "5D95A65A4A8133DD7828EAB0D12F0353"
		},
		{
			"Source":
			{
				"Text": "进阶关卡2:"
			},
			"Translation":
			{
				"Text": "Advanced Level 2:"
			},
			"Key": "887109F8466B05761DAE97928EF4139A"
		},
		{
			"Source":
			{
				"Text": "进阶关卡3:"
			},
			"Translation":
			{
				"Text": "Advanced Level 3:"
			},
			"Key": "BF475C6B465578CBBE98C9B02E2408DD"
		},
		{
			"Source":
			{
				"Text": "进阶关卡4:"
			},
			"Translation":
			{
				"Text": "Advanced Level 4:"
			},
			"Key": "2208DE824FB2ED5547E9B5A4AFFE13FF"
		},
		{
			"Source":
			{
				"Text": "进阶关卡5:"
			},
			"Translation":
			{
				"Text": "Advanced Level 5:"
			},
			"Key": "B0EE66E44ED8AB3C7D7E48981CC65EA2"
		},
		{
			"Source":
			{
				"Text": "进阶关卡6:"
			},
			"Translation":
			{
				"Text": "Advanced Level 6:"
			},
			"Key": "C3944AED49B5902F999D06AC4911F276"
		},
		{
			"Source":
			{
				"Text": "进阶关卡7:"
			},
			"Translation":
			{
				"Text": "Advanced Level 7:"
			},
			"Key": "8BA83208455A490180840B991C420A0F"
		},
		{
			"Source":
			{
				"Text": "进阶关卡8:"
			},
			"Translation":
			{
				"Text": "Advanced Level 8:"
			},
			"Key": "9A44307B4E744161A29FA283EF9DF7C4"
		},
		{
			"Source":
			{
				"Text": "连续按两次R键, 可以回溯到上个关键时间节点."
			},
			"Translation":
			{
				"Text": "Press R twice quickly to rewind to the last key event."
			},
			"Key": "0DF39AD24253960F9B99E4A70F86A60E"
		},
		{
			"Source":
			{
				"Text": "递归功能依靠委托实现, 大概思路是:"
			},
			"Translation":
			{
				"Text": "Using delegates for the recursive functionality, with the general approach being:"
			},
			"Key": "0B6AAEB9428A944B00C171A9FC2C3528"
		},
		{
			"Source":
			{
				"Text": "通过修改\"项目设置 - ViewFinderRe - VFStepsRecorderDeveloperSettings - StepsRecorderTickInterval\"为0.01, 使其更加准确."
			},
			"Translation":
			{
				"Text": "For greater accuracy, set the StepsRecorderTickInterval value to 0.01 in the project settings: Project Settings -> ViewFinderRe -> VFStepsRecorderDeveloperSettings."
			},
			"Key": "ABD2EC924E9EACF5A55D82B8879C7D1F"
		},
		{
			"Source":
			{
				"Text": "都是原游戏的操作按键, 记不住没关系, 使用处会再次给出."
			},
			"Translation":
			{
				"Text": "All controls use the original game's key bindings. Don't worry if you can't remember them — prompts will be shown when needed."
			},
			"Key": "1138872A433BA118447957A6A283A43C"
		},
		{
			"Source":
			{
				"Text": "重叠的物体会向其进行注册, 进行增量记录Transform变动."
			},
			"Translation":
			{
				"Text": "Overlapped objects will be registered by it to incrementally record Transform changes."
			},
			"Key": "BA5295E34198096A460DBF8378AD584D"
		},
		{
			"Source":
			{
				"Text": "重置墙体"
			},
			"Translation":
			{
				"Text": "Reset all walls."
			},
			"Key": "A3BDCB5E4F905B599A17C8AA8D552E59"
		},
		{
			"Source":
			{
				"Text": "长按R回溯, 双击R回溯到上个关键事件,"
			},
			"Translation":
			{
				"Text": "Long-press R to rewind; Double-tap R to rewind to the last key event."
			},
			"Key": "CE7550094D40E49EE8382B81BC6DC7E5"
		},
		{
			"Source":
			{
				"Text": "长按鼠标右键进行拍照预览, 然后鼠标左键进行拍照."
			},
			"Translation":
			{
				"Text": "Hold down right mouse button to enter photo preview mode, then click left mouse button to take photo."
			},
			"Key": "899BB66241FDA48B7ED535973DA9A62B"
		},
		{
			"Source":
			{
				"Text": "除C++的默认蓝图类, _Hide和_Show是用来做当前关卡逻辑的蓝图."
			},
			"Translation":
			{
				"Text": "Aside from the base C++ BlueprintClass, _Hide and _Show are Blueprints used to handle the current level's logic."
			},
			"Key": "C7856802435FFBDE46BB50A16102006E"
		},
		{
			"Source":
			{
				"Text": "面前的墙既不在照片中显示, 也不被进入拍照流程,"
			},
			"Translation":
			{
				"Text": "The wall in front of you neither appears in Photo2D's image nor participates in the photo-taking process."
			},
			"Key": "A6A3EA484AF09E34F64D0EB8DB3F11CD"
		},
		{
			"Source":
			{
				"Text": "项目为一个空壳, 所有东西都包装在插件内."
			},
			"Translation":
			{
				"Text": "It's a minimal project that contains only this plug-in."
			},
			"Key": "F2F2E73F46995FF28FD697BFC8226C57"
		},
		{
			"Source":
			{
				"Text": "项目地址: https://github.com/StrangeDS/ViewFinderRe"
			},
			"Translation":
			{
				"Text": "Repository: https://github.com/StrangeDS/ViewFinderRe"
			},
			"Key": "42454EFB44C0425DBCA9D98BC02551D0"
		},
		{
			"Source":
			{
				"Text": "预制照片流程:"
			},
			"Translation":
			{
				"Text": "How to Prefabricate a photo:"
			},
			"Key": "AD26636C4177B6C11E3F1AA3DE97C47A"
		},
		{
			"Source":
			{
				"Text": "预览中单击鼠标左键放置照片."
			},
			"Translation":
			{
				"Text": "During preview, click left mouse button to place the photo."
			},
			"Key": "A52F089D45ED2909D48F47AE5B2C9538"
		},
		{
			"Source":
			{
				"Text": "预览时滚动鼠标滚轮可以旋转照片, 或将照片放置在头顶"
			},
			"Translation":
			{
				"Text": "During preview, scroll mouse wheel to rotate the photo or place it above your character."
			},
			"Key": "303105E843AA7B2816FDCBA9328D0C0A"
		}
	]
}